InformationRegisters/бит_ПениПоУслугамЖКХ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>бит_ПениПоУслугамЖКХ</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Начислять</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Процент</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_УслугиЖКХ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ПериодыНачисленияПени</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/бит_ПениПоУслугамЖКХ/Forms/ФормаРедактированияУправляемая/Ext/Form/Module.bsl
#Область ПеременныеМодуля

Перем мТекущаяСтрока Экспорт;      // Хранит текущую строку для редактирования.

Перем мТекущийПериод Экспорт;      // Хранит текущий период.

Перем мТекущаяОрганизация Экспорт; // Хранит текущее структурное подразделение.

Перем мТекущийПериодНачисления Экспорт; // Хранит текущий период начисления.

#КонецОбласти

#Область ПроцедурыИФункцииОбщегоНазначения

// Процедура заполняет кэш значений, необходимый при работе на клиенте.
//
&НаСервере
Процедура ЗаполнитьКэшЗначений(КэшированныеЗначения)

	КэшированныеЗначения  = Новый Структура;                              
	//КэшированныеЗначения.Вставить("ЭтоНовый"   , ?(Параметры.Ключ.Пустая(), Истина, Ложь));
	КэшированныеЗначения.Вставить("мТекущийПериод", Неопределено);
	КэшированныеЗначения.Вставить("мТекущаяОрганизация", Неопределено);
	КэшированныеЗначения.Вставить("мНачислять", Неопределено);
	КэшированныеЗначения.Вставить("мПроцент", Неопределено);
	КэшированныеЗначения.Вставить("мТекущийПериодНачисления", Неопределено);
	
КонецПроцедуры

// Процедура выполняет заполнение табличной части формы
//
&НаСервере
Процедура ЗаполнитьТабличнуюЧасть()
	
	Услуги.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата"        , Запись.Период);        
	Запрос.УстановитьПараметр("Организация" , Запись.Организация);
	Запрос.УстановитьПараметр("ПериодНачисления" , Запись.ПериодНачисления);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_УслугиЖКХ.Ссылка КАК Услуга,
	|	ЕСТЬNULL(бит_ПениПоУслугамЖКХСрезПоследних.Начислять, ЛОЖЬ) КАК Начислять,
	|	ЕСТЬNULL(бит_ПениПоУслугамЖКХСрезПоследних.Процент, 0) КАК Процент,
	|	ЛОЖЬ КАК НовЗначение,
	|	ЕСТЬNULL(бит_ПениПоУслугамЖКХСрезПоследних.Начислять, ЛОЖЬ) КАК НачислятьДо,
	|	ЕСТЬNULL(бит_ПениПоУслугамЖКХСрезПоследних.Процент, 0) КАК ПроцентДо
	|ИЗ
	|	Справочник.бит_УслугиЖКХ КАК бит_УслугиЖКХ
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ПениПоУслугамЖКХ.СрезПоследних(
	|				&Дата,
	|				Организация = &Организация
	|					И ПериодНачисления = &ПериодНачисления) КАК бит_ПениПоУслугамЖКХСрезПоследних
	|		ПО бит_УслугиЖКХ.Ссылка = бит_ПениПоУслугамЖКХСрезПоследних.Услуга
	|ГДЕ
	|	НЕ бит_УслугиЖКХ.Ссылка = ЗНАЧЕНИЕ(Справочник.бит_УслугиЖКХ.Пеня)";
		
	Результат = Запрос.Выполнить().Выгрузить();

	
	ЗначениеВДанныеФормы(Результат,Услуги);
	
	
	//Услуги = Запрос.Выполнить().Выгрузить();
	
КонецПроцедуры

// Функция проверяет наличие изменений в табличном поле.
//
// Параметры:
//  Нет.
//
&НаСервере
Функция ПроверитьНаличиеИзмененийВТЧ() Экспорт
    
	// Проверим наличие изменений в дереве настроек.
	ИзмененияЕсть = Ложь;
	
	Если Услуги.Количество() <> 0 Тогда
		
		// Поищем измененные строки.
		
		ТаблицаЗначенийУслуг = ДанныеФормыВЗначение(Услуги, Тип("ТаблицаЗначений"));
		
		НайденнаяСтрока = ТаблицаЗначенийУслуг.Найти(Истина, "НовЗначение");
		ИзмененияЕсть   = (Не НайденнаяСтрока = Неопределено);
		
	КонецЕсли;
	
	Возврат ИзмененияЕсть;
	
КонецФункции // ПроверитьНаличиеИзмененийВДеревеНастроек()

// Процедура выполняет запись ТЧ.
//
// Параметры:
//  Отказ - Булево.
//
&НаСервере
Процедура ВыполнитьЗапись(Отказ = Ложь)
	
	Если Не ЗначениеЗаполнено(Запись.Период) Тогда

		бит_ОбщегоНазначения.СообщитьОбОшибке("Не заполнено значение реквизита ""Период""!"
											 ,Отказ
											 ,"Проверка заполнения ""Настройки программы (БИТ)""");
		Возврат;
	КонецЕсли;
	
	Для каждого ТекСтрока Из Услуги Цикл
		
		Если ТекСтрока.НовЗначение Тогда
			
			МенеджерЗаписи = РегистрыСведений.бит_ПениПоУслугамЖКХ.СоздатьМенеджерЗаписи();
			
			МенеджерЗаписи.Период		     = Запись.Период;
			МенеджерЗаписи.Организация       = Запись.Организация;
			// БИТ_ЖКХ 17.12.2015 18:03:41 Начало правки...
			МенеджерЗаписи.ПериодНачисления  = Запись.ПериодНачисления;
			// БИТ_ЖКХ 17.12.2015 18:03:41 Конец правки.
			
			ЗаполнитьЗначенияСвойств(МенеджерЗаписи, ТекСтрока);
			
			// Попытаемся записать менеджер записи.
			ОтказЗаписи = Ложь;
			
			Попытка
				МенеджерЗаписи.Записать();
			Исключение
				ТекстСообщения = "Не удалось записать значение настройки """ + ТекСтрока.Настройка + """: ";
				бит_ОбщегоНазначения.СообщитьОбОшибке(ТекстСообщения + ОписаниеОшибки(), ОтказЗаписи);
			КонецПопытки;
			
			Если Не Отказ И ОтказЗаписи Тогда
				Отказ = Истина;
			КонецЕсли;
			
		КонецЕсли;
	КонецЦикла;
	
	Если Не Отказ Тогда
		// Заполним дерево настроек.
		ЗаполнитьТабличнуюЧасть();
	КонецЕсли;
	
КонецПроцедуры // ВыполнитьЗаписьНастроек()

// Функция выполняет проверку изменения настроек и задает вопрос (если они есть),
// выполнение действия будет зависеть от ответа пользователя.
//
// Параметры:
//  ТекстВопроса      - Строка.
//  ЗаголовокВопроса  - Строка.
//  ДобавлятьДопТекст - Булево, флаг добавления текста ". Продолжить?" к тексту вопроса,
//                      по умолчанию Истина.
//
// Возвращаемое значение:
//  Заполнять - Булево.
//
&НаКлиенте
Функция ПродолжитьВыполнениеДействия(ТекстВопроса = "Будет выполнено перезаполнение табличной части",
                                     ЗаголовокВопроса = "Перезаполнение услуг", ДобавлятьДопТекст = Истина)
    
    Заполнять = Истина;
    
    // Проверим были ли внесены изменения в дереве настроек.
    Если ПроверитьНаличиеИзмененийВТЧ() Тогда
		
		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Данные были изменены. " + ТекстВопроса);
		
    КонецЕсли;
    
    Возврат Заполнять;
    
КонецФункции // ПродолжитьВыполнениеДействия()

#КонецОбласти

#Область ДействияКомандФормы

//  Процедура - обработчик события "Нажатие" кнопки "СнятьНачислять" 
//  коммандной панели "КоманднаяПанельУслуги".
//
&НаКлиенте
Процедура КоманднаяПанельУслугиСнятьНачислять(Команда)
	
	Для каждого ТекСтрока Из Услуги Цикл
	
		 ТекСтрока.Начислять = Ложь;
		 
	      УслугиНачислятьПриИзмененииНаСервере(ТекСтрока.Услуга, ТекСтрока.НачислятьДо, ТекСтрока.Начислять)
		 
	 КонецЦикла;
	
КонецПроцедуры

//  Процедура - обработчик события "Нажатие" кнопки "УстановитьНачислять" 
//  коммандной панели "КоманднаяПанельУслуги".
//
&НаКлиенте
Процедура КоманднаяПанельУслугиУстановитьНачислять(Команда)
	
	Для каждого ТекСтрока Из Услуги Цикл
	
		 ТекСтрока.Начислять = Истина;
		 
	      УслугиНачислятьПриИзмененииНаСервере(ТекСтрока.Услуга, ТекСтрока.НачислятьДо, ТекСтрока.Начислять)
	КонецЦикла; 
	
КонецПроцедуры

//  Процедура - обработчик события "Нажатие" кнопки "ОсновныеДействияФормыОК" 
//  коммандной панели "ОсновныеДействияФормы".
//
&НаКлиенте
Процедура ОсновныеДействияФормыОсновныеДействияФормыОК(Команда)
	
	Отказ = Ложь;
	
	// Выполним запись настроек.
	ВыполнитьЗапись(Отказ);
	
	Если Не Отказ Тогда
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийФормы

// Процедура - обработчик события "ПриСозданииНаСервере" формы.
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьКэшЗначений(мКэшЗначений);
	
	Если Параметры.Свойство("Добавить") Тогда
		
			Период = ТекущаяДата();
			
			Если НЕ ЗначениеЗаполнено(Организация) Тогда
				Запись.Организация = бит_ОбщиеПеременныеСервер.ЗначениеПеременной("ОсновнаяОрганизация");
			КонецЕсли;
		
	Иначе
		
		мТекущаяСтрока =  Параметры.Ключ;
		
		мКэшЗначений.мТекущийПериод = Параметры.Ключ.Период;
		
		мКэшЗначений.мТекущаяОрганизация = Параметры.Ключ.Организация;
		
		мКэшЗначений.мТекущийПериодНачисления = Параметры.Ключ.ПериодНачисления;
		
		Модифицированность = Ложь;
		
	КонецЕсли;	
	
		ЗаполнитьТабличнуюЧасть();
	
КонецПроцедуры

// Процедура - обработчик события "ПередЗакрытием" формы.
//
&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если ЗавершениеРаботы Тогда
		Возврат;
	КонецЕсли;
	
	// Проверим были ли внесены изменения в дереве настроек.
    Если ПроверитьНаличиеИзмененийВТЧ() Тогда
		
		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Данные были изменены. ");
		
		// Выполним запись настроек.
		ВыполнитьЗапись(Отказ);
		
    КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийЭлементовФормы

//  Процедура - обработчик события "ПриИзменении" поля ввода "Период".
// 
&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	
	Если мКэшЗначений.мТекущийПериод = Запись.Период Тогда
		Возврат;
	КонецЕсли;
	
	// Если пользователь ответил положительно на
	// вопрос о перезаполнении дерева настроек, тогда.
	Если ПродолжитьВыполнениеДействия() Тогда
		
		// Заполним дерево настроек.
		ЗаполнитьТабличнуюЧасть();
		
	Иначе
		Запись.Период = мКэшЗначений.мТекущийПериод;
	КонецЕсли;
	
	мКэшЗначений.мТекущийПериод = Запись.Период;
	
КонецПроцедуры

//  Процедура - обработчик события "ПриИзменении" поля ввода "Организация".
// 
&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)

	Если мКэшЗначений.мТекущаяОрганизация = Запись.Организация Тогда
		Возврат;
	КонецЕсли;
	
	// Если пользователь ответил положительно на
	// вопрос о перезаполнении дерева настроек, тогда.
	Если ПродолжитьВыполнениеДействия() Тогда
		
		// Заполним дерево настроек.
		ЗаполнитьТабличнуюЧасть();
		
	Иначе
		Запись.Организация = мКэшЗначений.мТекущаяОрганизация;
	КонецЕсли;
	
	мКэшЗначений.мТекущаяОрганизация = Запись.Организация;
	
КонецПроцедуры

//  Процедура - обработчик события "Очистка" поля ввода "Организация".
// 
&НаКлиенте
Процедура ОрганизацияОчистка(Элемент, СтандартнаяОбработка)
	
	// Если пользователь ответил положительно на
    // вопрос о перезаполнении дерева настроек, тогда.
    Если ПродолжитьВыполнениеДействия() Тогда
		
		// Заполним ТЧ.
		ЗаполнитьТабличнуюЧасть();
		
	Иначе
		СтандартнаяОбработка = Ложь;
    КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодНачисленияПриИзменении(Элемент)
	
	Если мКэшЗначений.мТекущийПериодНачисления = Запись.ПериодНачисления Тогда
		Возврат;
	КонецЕсли;
	
	// Если пользователь ответил положительно на
	// вопрос о перезаполнении дерева настроек, тогда.
	Если ПродолжитьВыполнениеДействия() Тогда
		
		// Заполним дерево настроек.
		ЗаполнитьТабличнуюЧасть();
		
	Иначе
		Запись.ПериодНачисления = мКэшЗначений.мТекущийПериодНачисления;
	КонецЕсли;
	
	мКэшЗначений.мТекущийПериодНачисления = Запись.ПериодНачисления;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодНачисленияОчистка(Элемент, СтандартнаяОбработка)
	
	// Если пользователь ответил положительно на
	// вопрос о перезаполнении дерева настроек, тогда.
	Если ПродолжитьВыполнениеДействия() Тогда
		
		// Заполним ТЧ.
		ЗаполнитьТабличнуюЧасть();
		
	Иначе
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийТабличногоПоляУслуги

//  Процедура - обработчик события "ПриИзменении" табличного поля "Начислять" таблицы "Услуги".
//
&НаКлиенте
Процедура УслугиНачислятьПриИзменении(Элемент)
	
	ТекДанные = Элементы.Услуги.ТекущиеДанные;
	
	Услуга = ТекДанные.Услуга;
	
	Начислять = ТекДанные.Начислять;
	
	НачислятьДо = мКэшЗначений.мНачислять;
	
	УслугиНачислятьПриИзмененииНаСервере(Услуга, НачислятьДо, Начислять);

	МассивСтрок = Услуги.НайтиСтроки(Новый Структура("Услуга",Услуга));
	Если МассивСтрок.Количество() > 0 Тогда
		ТекИдентификатор = МассивСтрок[0].ПолучитьИдентификатор();
		Если ЗначениеЗаполнено(ТекИдентификатор) Тогда
			Элементы.Услуги.ТекущаяСтрока = ТекИдентификатор;	
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура УслугиНачислятьПриИзмененииНаСервере(Услуга, НачислятьДо, Начислять)
	
	ТаблицаЗначенийУслуг = ДанныеФормыВЗначение(Услуги, Тип("ТаблицаЗначений"));
	
	СтрокаТаблицы = ТаблицаЗначенийУслуг.Найти(Услуга, "Услуга");
	
	СтрокаТаблицы.НовЗначение = ?(Не Начислять = НачислятьДо, Истина, Ложь);
	
	СтрокаТаблицы.Начислять = Начислять;

	ЗначениеВДанныеФормы(ТаблицаЗначенийУслуг,Услуги);
	
КонецПроцедуры

//  Процедура - обработчик события "ПриИзменении" поля ввода "Процент" табличного поля "Услуги".
//
&НаКлиенте
Процедура УслугиПроцентПриИзменении(Элемент)
	
	ТекДанные = Элементы.Услуги.ТекущиеДанные;
	
	Услуга = ТекДанные.Услуга;
	
	Процент = ТекДанные.Процент;
	
	ПроцентДо = мКэшЗначений.мПроцент;
	
	УслугиПроцентПриИзмененииНаСервере(Услуга, ПроцентДо, Процент);
	
	МассивСтрок = Услуги.НайтиСтроки(Новый Структура("Услуга",Услуга));
	Если МассивСтрок.Количество() > 0 Тогда
		ТекИдентификатор = МассивСтрок[0].ПолучитьИдентификатор();
		Если ЗначениеЗаполнено(ТекИдентификатор) Тогда
			Элементы.Услуги.ТекущаяСтрока = ТекИдентификатор;	
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УслугиПроцентПриИзмененииНаСервере(Услуга, ПроцентДо, Процент)
	
	ТаблицаЗначенийУслуг = ДанныеФормыВЗначение(Услуги, Тип("ТаблицаЗначений"));
	
	СтрокаТаблицы = ТаблицаЗначенийУслуг.Найти(Услуга, "Услуга");
	
	СтрокаТаблицы.НовЗначение = ?(Не Процент = ПроцентДо, Истина, Ложь);
	
	СтрокаТаблицы.Процент = Процент;

	ЗначениеВДанныеФормы(ТаблицаЗначенийУслуг,Услуги);
	
КонецПроцедуры

//  Процедура - записывает в кэш "Процент" и "Начислять" табличного поля "Услуги".
//
&НаКлиенте
Процедура УслугиПриАктивизацииСтроки(Элемент)
	
	ТекСтрока = Элементы.Услуги.ТекущиеДанные;
	Если ТипЗнч(Элементы.Услуги.ТекущиеДанные) = Тип("ДанныеФормыЭлементКоллекции") Тогда
		мКэшЗначений.мНачислять = ТекСтрока.Начислять;
		мКэшЗначений.мПроцент = ТекСтрока.Процент;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОператорыОсновнойПрограммы

мТекущаяСтрока = Неопределено;

#КонецОбласти
